XMLValidation/MTAS.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3g="http://schemas.ericsson.com/cai3g1.2/">
    <SOAP-ENV:Header>
        <cai3g:TransactionId>0000058682360000002</cai3g:TransactionId>
        <cai3g:SessionId>A10D249D120D197Z1570025079S1266P65539</cai3g:SessionId>
        <cai3g:SequenceId>1698681251</cai3g:SequenceId>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <cai3g:Create>
            <cai3g:MOType>MMTel@http://schemas.ericsson.com/mtas/mmtel/cai3g</cai3g:MOType>
            <cai3g:MOId>
                <mc:publicId xmlns="http://schema.evolving.com/Tertio/FeatureSet/AgentEPTInterface/1.3" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:mc="http://schemas.ericsson.com/mtas/mmtel/cai3g" xmlns:mgc="http://schemas.ericsson.com/mtas/mmtel-group/cai3g" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">sip:+447996260058@ims.ee.co.uk</mc:publicId>
            </cai3g:MOId>
            <cai3g:MOAttributes>
                <mc:createMMTel publicId="sip:+447996260058@ims.ee.co.uk" xmlns="http://schema.evolving.com/Tertio/FeatureSet/AgentEPTInterface/1.3" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:mc="http://schemas.ericsson.com/mtas/mmtel/cai3g" xmlns:mgc="http://schemas.ericsson.com/mtas/mmtel-group/cai3g" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <mc:publicId>sip:+447996260058@ims.ee.co.uk</mc:publicId>
                    <mc:common-data>
                        <mc:country-code>44</mc:country-code>
                        <mc:service-profile-identity>sip:paym-profile@ims.ee.co.uk</mc:service-profile-identity>
                    </mc:common-data>
                    <mc:communication-diversion>
                        <mc:cdiv-operator-configuration>
                            <mc:activated>true</mc:activated>
                            <mc:cdiv-ruleset-for-post-evaluation>
                                <mc:cdiv-ruleset>
                                    <mc:cdiv-rule id="IVR_redirect">
                                        <mc:id>IVR_redirect</mc:id>
                                        <mc:cdiv-conditions>
                                            <mc:rule-deactivated>false</mc:rule-deactivated>
                                            <mc:cdiv-call-state>not-registered</mc:cdiv-call-state>
                                        </mc:cdiv-conditions>
                                        <mc:cdiv-actions>
                                            <mc:forward-to>
                                                <mc:target>tel:576254447996260058;phone-context=+44</mc:target>
                                                <mc:notify-caller>false</mc:notify-caller>
                                            </mc:forward-to>
                                        </mc:cdiv-actions>
                                    </mc:cdiv-rule>
                                </mc:cdiv-ruleset>
                            </mc:cdiv-ruleset-for-post-evaluation>
                            <mc:user-no-reply-timer>activated</mc:user-no-reply-timer>
                            <mc:cdiv-op-conditions>
                                <mc:busy-condition>activated</mc:busy-condition>
                                <mc:not-registered-condition>activated</mc:not-registered-condition>
                                <mc:no-answer-condition>activated</mc:no-answer-condition>
                                <mc:not-reachable-condition>activated</mc:not-reachable-condition>
                                <mc:unconditional-condition>activated</mc:unconditional-condition>
                            </mc:cdiv-op-conditions>
                        </mc:cdiv-operator-configuration>
                        <mc:cdiv-user-configuration>
                            <mc:active>true</mc:active>
                            <mc:cdiv-ruleset>
                                <mc:cdiv-rule id="CFU">
                                    <mc:id>CFU</mc:id>
                                    <mc:cdiv-conditions>
                                        <mc:rule-deactivated>true</mc:rule-deactivated>
                                        <mc:cdiv-call-state>unconditional</mc:cdiv-call-state>
                                    </mc:cdiv-conditions>
                                </mc:cdiv-rule>
                                <mc:cdiv-rule id="CFB">
                                    <mc:id>CFB</mc:id>
                                    <mc:cdiv-conditions>
                                        <mc:rule-deactivated>false</mc:rule-deactivated>
                                        <mc:cdiv-call-state>busy</mc:cdiv-call-state>
                                    </mc:cdiv-conditions>
                                    <mc:cdiv-actions>
                                        <mc:forward-to>
                                            <mc:target>tel:+447953222222</mc:target>
                                        </mc:forward-to>
                                    </mc:cdiv-actions>
                                </mc:cdiv-rule>
                                <mc:cdiv-rule id="CFNR">
                                    <mc:id>CFNR</mc:id>
                                    <mc:cdiv-conditions>
                                        <mc:rule-deactivated>false</mc:rule-deactivated>
                                        <mc:cdiv-call-state>no-answer</mc:cdiv-call-state>
                                    </mc:cdiv-conditions>
                                    <mc:cdiv-actions>
                                        <mc:forward-to>
                                            <mc:target>tel:+447953222222</mc:target>
                                        </mc:forward-to>
                                    </mc:cdiv-actions>
                                </mc:cdiv-rule>
                                <mc:cdiv-rule id="CFNRc">
                                    <mc:id>CFNRc</mc:id>
                                    <mc:cdiv-conditions>
                                        <mc:rule-deactivated>false</mc:rule-deactivated>
                                        <mc:cdiv-call-state>not-reachable</mc:cdiv-call-state>
                                    </mc:cdiv-conditions>
                                    <mc:cdiv-actions>
                                        <mc:forward-to>
                                            <mc:target>tel:+447953222222</mc:target>
                                        </mc:forward-to>
                                    </mc:cdiv-actions>
                                </mc:cdiv-rule>
                                <mc:cdiv-rule id="CFNL">
                                    <mc:id>CFNL</mc:id>
                                    <mc:cdiv-conditions>
                                        <mc:rule-deactivated>false</mc:rule-deactivated>
                                        <mc:cdiv-call-state>not-registered</mc:cdiv-call-state>
                                    </mc:cdiv-conditions>
                                    <mc:cdiv-actions>
                                        <mc:forward-to>
                                            <mc:target>tel:+447953222222</mc:target>
                                        </mc:forward-to>
                                    </mc:cdiv-actions>
                                </mc:cdiv-rule>
                            </mc:cdiv-ruleset>
                        </mc:cdiv-user-configuration>
                    </mc:communication-diversion>
                    <mc:communication-waiting>
                        <mc:cw-operator-configuration>
                            <mc:activated>true</mc:activated>
                        </mc:cw-operator-configuration>
                        <mc:cw-user-configuration>
                            <mc:active>true</mc:active>
                        </mc:cw-user-configuration>
                    </mc:communication-waiting>
                    <mc:incoming-communication-barring>
                        <mc:icb-operator-configuration>
                            <mc:activated>false</mc:activated>
                            <mc:icb-ruleset>
                                <mc:icb-rule id="BICRO">
                                    <mc:id>BICRO</mc:id>
                                    <mc:icb-conditions>
                                        <mc:rule-deactivated>true</mc:rule-deactivated>
                                        <mc:roaming>true</mc:roaming>
                                    </mc:icb-conditions>
                                    <mc:cb-actions>
                                        <mc:allow>false</mc:allow>
                                        <mc:play-announcement>PAYM_BICRO</mc:play-announcement>
                                    </mc:cb-actions>
                                </mc:icb-rule>
                            </mc:icb-ruleset>
                        </mc:icb-operator-configuration>
                        <mc:icb-user-configuration>
                            <mc:active>false</mc:active>
                        </mc:icb-user-configuration>
                    </mc:incoming-communication-barring>
                    <mc:northbound-call-control>
                        <mc:ncc-operator-configuration>
                            <mc:activated>true</mc:activated>
                            <mc:gsm-scf-address>447953799307</mc:gsm-scf-address>
                            <mc:originating-service-key>40992</mc:originating-service-key>
                            <mc:terminating-service-key>-1</mc:terminating-service-key>
                            <mc:default-call-handling>continue</mc:default-call-handling>
                            <mc:imsi>234307996260058</mc:imsi>
                        </mc:ncc-operator-configuration>
                    </mc:northbound-call-control>
                    <mc:operator-controlled-outgoing-barring-programs>
                        <mc:ocobp-operator-configuration>
                            <mc:activated>true</mc:activated>
                            <mc:operator-barring-program>
                                <mc:category-name>PAYM_PRA</mc:category-name>
                            </mc:operator-barring-program>
                        </mc:ocobp-operator-configuration>
                    </mc:operator-controlled-outgoing-barring-programs>
                    <mc:outgoing-communication-barring>
                        <mc:ocb-operator-configuration>
                            <mc:activated>false</mc:activated>
                        </mc:ocb-operator-configuration>
                        <mc:ocb-user-configuration>
                            <mc:active>false</mc:active>
                        </mc:ocb-user-configuration>
                    </mc:outgoing-communication-barring>
                    <mc:originating-identity-presentation>
                        <mc:oip-operator-configuration>
                            <mc:activated>true</mc:activated>
                        </mc:oip-operator-configuration>
                        <mc:oip-user-configuration>
                            <mc:active>true</mc:active>
                        </mc:oip-user-configuration>
                    </mc:originating-identity-presentation>
                    <mc:originating-identity-presentation-restriction>
                        <mc:oir-operator-configuration>
                            <mc:activated>true</mc:activated>
                            <mc:mode>ad-hoc-temporary-presentation-not-restricted</mc:mode>
                        </mc:oir-operator-configuration>
                        <mc:oir-user-configuration>
                            <mc:active>true</mc:active>
                            <mc:default-behaviour>presentation-not-restricted</mc:default-behaviour>
                        </mc:oir-user-configuration>
                    </mc:originating-identity-presentation-restriction>
                    <mc:supplementary-service-codes>
                        <mc:ssc-operator-configuration>
                            <mc:activated>true</mc:activated>
                        </mc:ssc-operator-configuration>
                    </mc:supplementary-service-codes>
                </mc:createMMTel>
            </cai3g:MOAttributes>
        </cai3g:Create>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


